
&НаСервере
Процедура ПриОткрытииНаСервере()
	ЭтотОбъект_ = РеквизитФормыВЗначение("Объект");
	ЭтотОбъект_.выполнитьКоманду("!!");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	ПроверкаОбработкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверкаОбработкиНаСервере()
	ЭтотОбъект_ = РеквизитФормыВЗначение("Объект");
	ЭтотОбъект_.выполнитьКоманду("!!");
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаОбработки(Команда)
	ПроверкаОбработкиНаСервере();
КонецПроцедуры
