
&НаКлиенте
Процедура ТекстHTMLДокументСформирован(Элемент)
	ПодключитьОбработчикОжидания("СформируйHTML_НаКлиенте", 0.1,Истина)
КонецПроцедуры

&НаСервере
Функция ПолучиПараметрыСоединенияПоПрефиксуИБ(ПрефиксИБ)
	ЗначениеПоУмолчанию = "";
	
	Доступно = ТипЗнч(ПрефиксИБ) = Тип("Строка");
	Доступно = Доступно И ЗначениеЗаполнено(ПрефиксИБ);
	
	Если Не Доступно Тогда
		Возврат  ЗначениеПоУмолчанию;
	КонецЕсли;
	
	//ЗагрузиРемонтыАвто_И_ЗадачиЛояльности_Из_АльфаАвто4("Srvr=""MainAppL""; Ref=""ufa_rarus"";", "0000000005");		//Уфа	  
	//ЗагрузиРемонтыАвто_И_ЗадачиЛояльности_Из_АльфаАвто4("Srvr=""mainApp:1641""; Ref=""rm_rarus""; Usr=""Администратор""; Pwd=""829016625"";", "0000000005");		//Саранск	
	//ЗагрузиРемонтыАвто_И_ЗадачиЛояльности_Из_АльфаАвто4("Srvr=""mainApp:1641""; Ref=""cheb_rarus""; Usr=""Администратор""; Pwd=""829016625"";", "0000000005");	//Чебоксары	
	//ЗагрузиРемонтыАвто_И_ЗадачиЛояльности_Из_АльфаАвто4("Srvr=""MainAppL""; Ref=""sto_oper"";", "0000000005");	//Казань	
	//ЗагрузиРемонтыАвто_И_ЗадачиЛояльности_Из_АльфаАвто5("Srvr=""MainAppL""; Ref=""luidor_sto""; Usr=""LuidorAdmin""; Pwd=""829016625"";", "АМ");	// Нижний Новгород		
	//ЗагрузиРемонтыАвто_И_ЗадачиЛояльности_Из_АльфаАвто5("Srvr=""MainApp""; Ref=""alc_oper""; Usr=""LuidorAdmin""; Pwd=""829016625"";", "АА");	// Москва	
	
	ПараметрыСоединения = "";
	
	Если ПрефиксИБ = "ОУ" Тогда
		//ИдВидаДокумента 				= "НЭРеализация";
		ПараметрыСоединения = "Srvr=""MainAPPM"";Ref=""asc_oper"";Usr=""ВнешнееПриложение"";Pwd=""Luidor158851"";";		
	КонецЕсли;
	
	Возврат  ПараметрыСоединения
КонецФункции

&НаСервере
Функция ПолучиИдВидаДокументаПоПрефиксуИБ(ПрефиксИБ)
	ЗначениеПоУмолчанию = "";
	
	Доступно = ТипЗнч(ПрефиксИБ) = Тип("Строка");
	Доступно = Доступно И ЗначениеЗаполнено(ПрефиксИБ);
	
	Если Не Доступно Тогда
		Возврат  ЗначениеПоУмолчанию;
	КонецЕсли;

	ИдВидаДокумента = "";
	
	Если 		ПрефиксИБ = "ОУ" Тогда
		ИдВидаДокумента 	= "НЭРеализация";
		//ПараметрыСоединения = "Srvr=""MainAPPL"";Ref=""asc_oper"";Usr=""ВнешнееПриложение"";Pwd=""Luidor158851"";";		
	ИначеЕсли 	ПрефиксИБ =	"АА" Тогда
		ИдВидаДокумента 	= "ЗаказНаряд"; //Москва
		//ПараметрыСоединения = "Srvr=""MainApp""; Ref=""alc_oper""; Usr=""LuidorAdmin""; Pwd=""829016625"";";
	ИначеЕсли 	ПрефиксИБ =	"AМ" Тогда //Нижний Новгород, тюнинг
		ИдВидаДокумента 	= "ЗаказНаряд";
		//ПараметрыСоединения = "Srvr=""MainAppL""; Ref=""luidor_sto""; Usr=""LuidorAdmin""; Pwd=""829016625"";";
	ИначеЕсли 	ПрефиксИБ =	"AУ" Тогда // Уфа
		ИдВидаДокумента 	= "ЗаказНаряд";
		//ПараметрыСоединения = "Srvr=""MainAppL""; Ref=""ufa_rarus"";";
	ИначеЕсли 	ПрефиксИБ =	"AС" Тогда //Саранск
		ИдВидаДокумента 	= "ЗаказНаряд";
		//ПараметрыСоединения = "Srvr=""mainApp:1641""; Ref=""rm_rarus""; Usr=""Администратор""; Pwd=""829016625"";";
	ИначеЕсли 	ПрефиксИБ =	"АЧ" Тогда //Чебоксары
		ИдВидаДокумента 	= "ЗаказНаряд";
		//ПараметрыСоединения = "Srvr=""mainApp:1641""; Ref=""cheb_rarus""; Usr=""Администратор""; Pwd=""829016625"";";	
	ИначеЕсли 	ПрефиксИБ =	"АК" Тогда //Казань
		ИдВидаДокумента 	= "ЗаказНаряд";
		//ПараметрыСоединения = "Srvr=""MainAppL""; Ref=""sto_oper"";";
	КонецЕсли;
	
	Возврат  ИдВидаДокумента
КонецФункции

&НаСервере
Функция СформируйHTML_НаСервере()
	Доступно = ЗначениеЗаполнено(ЭтаФорма.Параметры.ПараметрыСоединения);
	Доступно = Доступно И ЗначениеЗаполнено(ЭтаФорма.Параметры.ИдОбъектаМетаданных);
	Доступно = Доступно И ЗначениеЗаполнено(ЭтаФорма.Параметры.ИдВидаОбъекта);
	Доступно = Доступно И ЗначениеЗаполнено(ЭтаФорма.Параметры.ГУИДОбъектаСтрокой);
	
	Если Не Доступно Тогда
		Возврат ""
	КонецЕсли;

	
	стрДанныеДокумента 				= БазаИсточник__ПолучиДанныеДокумента(	ЭтаФорма.Параметры.ПараметрыСоединения, 
																			ЭтаФорма.Параметры.ИдОбъектаМетаданных, 
																			ЭтаФорма.Параметры.ИдВидаОбъекта,
																			ЭтаФорма.Параметры.ГУИДОбъектаСтрокой);
	Если ТипЗнч(стрДанныеДокумента)<>Тип("Структура") Тогда
		ЭтаФорма.ТекстHTML = "Нет подключения";
		Возврат ""
	КонецЕсли;
	
	тзШапкаДокумента 				= стрДанныеДокумента.ШапкаДокумента;	
	ТекстHTML = ПолучиМакетИзЭтогоОбъекта("МакетHTML1");
	
	//<вывод шапки>
	htmlТаблицаШапкиДокумента		= КонвертируйТаблицуЗначений_в_HTMLТаблицу(тзШапкаДокумента, "classDocHeadTable", "ТипИСсылка");
	ТекстHTML 	= СтрЗаменить(ТекстHTML, "#ШапкаДокумента#", htmlТаблицаШапкиДокумента); 	
	//</вывод шапки>
	
	//<вывод табличных частей и движений регистров>
	Сч = 0;
	Для Каждого КлЗнч Из стрДанныеДокумента Цикл
		Если СтрНайти(КлЗнч.Ключ, "ТабличнаяЧасть_")>0 Тогда
			Сч = Сч+1;
			тзТаблЧасть						= КлЗнч.Значение;
			htmlТабличнаяЧасть				= КонвертируйТаблицуЗначенийТабличнойЧасти_в_HTMLТаблицу(тзТаблЧасть, "classDocTableРаrt");
			ТекстHTML	= СтрЗаменить(ТекстHTML, "#ТабличнаяЧасть"+Сч+"#", htmlТабличнаяЧасть);
			ТекстHTML	= СтрЗаменить(ТекстHTML, "ТабличнаяЧасть"+Сч, СтрЗаменить(КлЗнч.Ключ,"_", " "));
		ИначеЕсли СтрНайти(КлЗнч.Ключ, "ДвижениеНЭ")>0 Тогда  //движение по регистру ДвижениеНЭ
			тзТаблЧасть						= КлЗнч.Значение;
			htmlТабличнаяЧасть				= КонвертируйТаблицуЗначений_в_HTMLТаблицу(тзТаблЧасть, "classReg");
			ТекстHTML	= СтрЗаменить(ТекстHTML, "#ДвижениеНЭ#", htmlТабличнаяЧасть);
		ИначеЕсли СтрНайти(КлЗнч.Ключ, "СебестоимостьНЭ")>0 Тогда  //движение по регистру ДвижениеНЭ
			тзТаблЧасть						= КлЗнч.Значение;
			htmlТабличнаяЧасть				= КонвертируйТаблицуЗначений_в_HTMLТаблицу(тзТаблЧасть, "classReg");
			ТекстHTML	= СтрЗаменить(ТекстHTML, "#СебестоимостьНЭ#", htmlТабличнаяЧасть);
			
		КонецЕсли;
	КонецЦикла;
	//</вывод табличных частей и движений регистров>

	//<Если нет табличных частей>
	ТекстHTML	= СтрЗаменить(ТекстHTML, "#ТабличнаяЧасть1#", "");
	ТекстHTML	= СтрЗаменить(ТекстHTML, "ТабличнаяЧасть1", "");
	
	ТекстHTML	= СтрЗаменить(ТекстHTML, "#ТабличнаяЧасть2#", "");
	ТекстHTML	= СтрЗаменить(ТекстHTML, "ТабличнаяЧасть2", "");
	
	ТекстHTML	= СтрЗаменить(ТекстHTML, "#ТабличнаяЧасть3#", "");
	ТекстHTML	= СтрЗаменить(ТекстHTML, "ТабличнаяЧасть3", "");
	
	ТекстHTML	= СтрЗаменить(ТекстHTML, "#ТабличнаяЧасть4#", "");
	ТекстHTML	= СтрЗаменить(ТекстHTML, "ТабличнаяЧасть4", "");
	//</Если нет табличных частей>

	//<Если нет движений регистров>
	Если СтрНайти(ТекстHTML, "#ДвижениеНЭ#") Тогда
		ТекстHTML	= СтрЗаменить(ТекстHTML, "#ДвижениеНЭ#", "");
		ТекстHTML	= СтрЗаменить(ТекстHTML, "Регистр накопления ДвижениеНЭ", "");
	КонецЕсли;
	
	Если СтрНайти(ТекстHTML, "#СебестоимостьНЭ#") Тогда
		ТекстHTML	= СтрЗаменить(ТекстHTML, "#СебестоимостьНЭ#", "");
		ТекстHTML	= СтрЗаменить(ТекстHTML, "Регистр накопления СебестоимостьНЭ", "");
	КонецЕсли;
    //</Если нет движений регистров>

	ЭтаФорма.ТекстHTML = ТекстHTML;
	
	стрДанныеДокумента="";	//очистить ком-объекты

КонецФункции

&НаКлиенте
Процедура СформируйHTML_НаКлиенте()
	СформируйHTML_НаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура СформируйHTML(Команда)
	СформируйHTML_НаКлиенте();	
КонецПроцедуры

&НаСервере
Функция ПолучиМакетИзЭтогоОбъекта(ИмяМакета)
	
	Доступно = ТипЗнч(ИмяМакета) = Тип("Строка");
	Доступно = Доступно И ЗначениеЗаполнено(ИмяМакета);
	ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ = "<html><body>Ошибка поиска макета</body></html>";
	
	Если Не Доступно Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ 
	КонецЕсли;
	
	ЭтаОбработка = РеквизитФормыВЗначение("Объект");	
	Оболочка = ЭтаОбработка.НTML__ПолучитьМакет(ИмяМакета);

	Результат = Оболочка.ПолучитьТекст();
	
	Доступно = ТипЗнч(Результат) = Тип("Строка");

	Если Не Доступно Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ 
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаСервере
Функция БазаИсточник__ПолучиДанныеДокумента(ПараметрыСоединения, ИдОбъекта, ИдВидаДокумента, ГУИДДокументаИсточникаСтрокой, ПрефиксБазы = "")

	//ПараметрыСоединения = "Srvr=""MainAPPL"";Ref=""asc_oper"";Usr=""ВнешнееПриложение"";Pwd=""Luidor158851"";";   // для серверной базы	
	
	//БазаИсточник = Коммуникатор.ПолучитьПодключениеБД(ПараметрыСоединения);

	БазаИсточник= Новый COMОбъект("V83.Application");
	Попытка 
		Результат = БазаИсточник.Connect(ПараметрыСоединения);
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат "ошибка com-соединения";
	КонецПопытки;

	Данные = "ИдВидаДокумента="+ИдВидаДокумента+"; ГУИДДокументаИсточникаСтрокой="+ГУИДДокументаИсточникаСтрокой; // для журнала регистрации
	
	Результат = Новый Соответствие();
	ТЗ = Новый ТаблицаЗначений();
	Результат.Вставить("ШапкаДокумента", ТЗ);
		
	БазаИсточник_ГУИД_ДокументаИсточника 	=	БазаИсточник.NewObject("УникальныйИдентификатор", ГУИДДокументаИсточникаСтрокой);
	Если ИдОбъекта = "Документ" Тогда
		БазаИсточник_ДокументСсылка 			=	БазаИсточник.Документы[ИдВидаДокумента].ПолучитьСсылку(БазаИсточник_ГУИД_ДокументаИсточника);
	ИначеЕсли ИдОбъекта = "Справочник" Тогда
		БазаИсточник_ДокументСсылка 			=	БазаИсточник.Справочники[ИдВидаДокумента].ПолучитьСсылку(БазаИсточник_ГУИД_ДокументаИсточника);
	КонецЕсли;
	БазаИсточник_МетаданныеРеквизиты		=  	БазаИсточник_ДокументСсылка.Метаданные().Реквизиты;
	
	//<Шапка документа>
	тз = Новый ТаблицаЗначений();
	тз.Колонки.Добавить("ИмяРеквизита");
	тз.Колонки.Добавить("ПредставлениеРеквизита");															// Синоним реквизита 
	кол = тз.Колонки.Добавить("ЗначениеРеквизита"); 														// текстовое представление значения реквизита
	кол.Заголовок="<Свойства><МожетСодержатьГиперСсылку>Истина</МожетСодержатьГиперСсылку></Свойства>";
	тз.Колонки.Добавить("ТипИСсылка");
	
	//Сформируй поля выборки запроса
	СписокПолейВыборки = "ПРЕДСТАВЛЕНИЕ(Ссылка) КАК Ссылка";	
	СтрокаТЗ							= тз.Добавить();
	СтрокаТЗ.ИмяРеквизита 				= "Ссылка";
	СтрокаТЗ.ПредставлениеРеквизита 	= "Ссылка";
		
	Для Каждого Эл Из БазаИсточник_МетаданныеРеквизиты Цикл
				СписокПолейВыборки = СписокПолейВыборки + ", ПРЕДСТАВЛЕНИЕ("+Эл.Имя+") КАК "+Эл.Имя;
				СписокПолейВыборки = СписокПолейВыборки + ", "+ Эл.Имя +" КАК "+Эл.Имя+"_Ссылка";
				СписокПолейВыборки = СписокПолейВыборки +  ", ТИПЗНАЧЕНИЯ("+Эл.Имя+") КАК "+Эл.Имя+"_Тип";
	
				НовСтрока = тз.Добавить();
				НовСтрока.ИмяРеквизита = Эл.Имя;
	КонецЦикла;
	
	//убери лидирующую запятую
	Если Лев(СписокПолейВыборки,1)="," Тогда
		СписокПолейВыборки = Прав(СписокПолейВыборки, СтрДлина(СписокПолейВыборки)-1);
	КонецЕсли;
		
	БазаИсточник_Запрос = БазаИсточник.NewObject("Запрос");
	БазаИсточник_Запрос.Текст = "ВЫБРАТЬ "+ СписокПолейВыборки+ " ИЗ " +ИдОбъекта +"." + ИдВидаДокумента + " КАК Ист ГДЕ Ист.Ссылка = &Ссылка";
	БазаИсточник_Запрос.УстановитьПараметр("Ссылка", БазаИсточник_ДокументСсылка);
	БазаИсточник_РезультатЗапроса = БазаИсточник_Запрос.Выполнить();
	Если БазаИсточник_РезультатЗапроса.Пустой() Тогда
		ЗаписьЖурналаРегистрации("БазаИсточник__ПолучиДанныеДокумента(). Пустой результат запроса", УровеньЖурналаРегистрации.Ошибка,,Данные, ОписаниеОшибки());
	КонецЕсли;
	
	БИ_Выборка = БазаИсточник_РезультатЗапроса.Выбрать();
	БИ_Выборка.Следующий();	
	
	СтрокаТЗ.ЗначениеРеквизита = БИ_Выборка["Ссылка"];
				
	Для Каждого Эл Из БазаИсточник_МетаданныеРеквизиты Цикл
		
		ИмяРеквизита =  Эл.Имя;
		ПредставлениеРекв = Эл.Представление();
		ЗначениеРекв = БИ_Выборка[Эл.Имя];
		
		ЗначениеРеквКакСсылка = БИ_Выборка[Эл.Имя+"_Ссылка"];
		
		Если ТипЗнч(ЗначениеРеквКакСсылка) = Тип("COMОбъект") Тогда
			ЗначениеРеквКакСсылка = БазаИсточник.xmlСтрока(ЗначениеРеквКакСсылка);
			
			//типзн1 = БазаИсточник.xmlТип(БИ_Выборка[Эл.Имя+"_Тип"]);	
			типзн2 =  БазаИсточник.xmlТип(БИ_Выборка[Эл.Имя+"_Тип"]).TypeName;	
		Иначе
			типзн2 = "";
			ЗначениеРеквКакСсылка = "";
		КонецЕсли;
				
		СтрокаТЗ = тз.Найти(Эл.Имя, "ИмяРеквизита");
		Если СтрокаТЗ = Неопределено Тогда
			СтрокаТЗ = тз.Добавить();
			СтрокаТЗ.ИмяРеквизита 					= ИмяРеквизита;
		КонецЕсли;
		СтрокаТЗ.ПредставлениеРеквизита 		= ПредставлениеРекв;
		СтрокаТЗ.ЗначениеРеквизита 				= ЗначениеРекв;
		
		структ1 = Новый Структура();
		структ1.Вставить("ПрефиксИБ"	,	ПрефиксБазы); 
		структ1.Вставить("Тип"			, 	типзн2);
		структ1.Вставить("Ссылка"		, 	ЗначениеРеквКакСсылка);
		СтрокаТЗ.ТипИСсылка = структ1;
	КонецЦикла;

	ТЗ.Колонки.Удалить(0);
	Результат = Новый Структура();
	Результат.Вставить("ШапкаДокумента", ТЗ);
	//</Шапка документа>
	
	//<Табл. части>
 	Для Каждого МетаТаблЧасть Из БазаИсточник_ДокументСсылка.Метаданные().ТабличныеЧасти Цикл
		
		   	тз = Новый ТаблицаЗначений();
			тз.Очистить();
			тз.Колонки.Очистить();

		     ТаблЧастьИмя = МетаТаблЧасть.Имя;
			 Результат.Вставить("ТабличнаяЧасть_"+ ТаблЧастьИмя, тз);
			 
			СписокПолейВыборки = "";
			Для Каждого МетаРекв Из МетаТаблЧасть.Реквизиты Цикл		
				СписокПолейВыборки = СписокПолейВыборки + ", ПРЕДСТАВЛЕНИЕ("+МетаРекв.Имя+") КАК "+МетаРекв.Имя;
				
				СписокПолейВыборки = СписокПолейВыборки + ", "+ МетаРекв.Имя +" КАК "+МетаРекв.Имя+"_Ссылка";

				СписокПолейВыборки = СписокПолейВыборки +  ", ТИПЗНАЧЕНИЯ("+МетаРекв.Имя+") КАК "+МетаРекв.Имя+"_Тип";

				НовКолонка = тз.Колонки.Добавить();
				Попытка
					НовКолонка.Имя = МетаРекв.Имя;
					НовКолонка.Заголовок = МетаРекв.Представление();
				Исключение
					//сообщить(МетаРекв.Имя+" "+ОписаниеОшибки());
					ЗаписьЖурналаРегистрации("БазаИсточник__ПолучиДанныеДокумента(). Ошибка создания колонки тз", УровеньЖурналаРегистрации.Ошибка,,Данные, ОписаниеОшибки());
					Продолжить;
				КонецПопытки;
				
				НовКолонка = тз.Колонки.Добавить();
				НовКолонка.Имя = МетаРекв.Имя+"_ТипИСсылка";
				НовКолонка.Заголовок="Системная";
			
			КонецЦикла;
			//убери лидирующую запятую
			Если Лев(СписокПолейВыборки,1)="," Тогда
				СписокПолейВыборки = Прав(СписокПолейВыборки, СтрДлина(СписокПолейВыборки)-1);
			КонецЕсли;
			
			БазаИсточник_Запрос = БазаИсточник.NewObject("Запрос");
			БазаИсточник_Запрос.Текст = "ВЫБРАТЬ "+ СписокПолейВыборки+ " ИЗ Документ." + ИдВидаДокумента + "."+ТаблЧастьИмя+" КАК Ист ГДЕ Ист.Ссылка = &Ссылка";
			БазаИсточник_Запрос.УстановитьПараметр("Ссылка", БазаИсточник_ДокументСсылка);
			БазаИсточник_РезультатЗапроса = БазаИсточник_Запрос.Выполнить();
			Если БазаИсточник_РезультатЗапроса.Пустой() Тогда
				//Сообщить("Пустой результат запроса");
				Продолжить;
			КонецЕсли;
	
			БИ_Выборка = БазаИсточник_РезультатЗапроса.Выбрать();
			Пока БИ_Выборка.Следующий() Цикл
				НоваяСтрока = тз.Добавить();
				
						
				Для Каждого Кол Из тз.Колонки Цикл
					Если СтрНайти(Кол.имя,"_ТипИСсылка") = 0 Тогда // взять данные из 
						НоваяСтрока[Кол.Имя] = БИ_Выборка[Кол.имя];
					Иначе
						
						КолИмяБезПостфикса__ТипИСсылка = СтрЗаменить(Кол.имя, "_ТипИСсылка", "") ;//; без постфикса _ТипИСсылка;
						
						структ1 = Новый Структура();
						НоваяСтрока[Кол.Имя] = структ1;
						
						ЗначениеРеквКакСсылка = БИ_Выборка[КолИмяБезПостфикса__ТипИСсылка+"_Ссылка"];
						Если ТипЗнч(ЗначениеРеквКакСсылка) = Тип("COMОбъект") Тогда
							ЗначениеРеквКакСсылка = БазаИсточник.xmlСтрока(ЗначениеРеквКакСсылка);
							типзн2 =  БазаИсточник.xmlТип(БИ_Выборка[КолИмяБезПостфикса__ТипИСсылка+"_Тип"]).TypeName;	
						Иначе
							ЗначениеРеквКакСсылка = "";
							типзн2 = "";
						КонецЕсли;
						
						НоваяСтрока[КолИмяБезПостфикса__ТипИСсылка+"_ТипИСсылка"].Вставить("ПрефиксИБ"		,	ПрефиксБазы); 
						НоваяСтрока[КолИмяБезПостфикса__ТипИСсылка+"_ТипИСсылка"].Вставить("Ссылка"		, 	ЗначениеРеквКакСсылка);
						НоваяСтрока[КолИмяБезПостфикса__ТипИСсылка+"_ТипИСсылка"].Вставить("Тип"			, 	типзн2);

					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
			тз = ВставьВТаблицуЗначенийПервойСтрокойЗаголовкиКолонок(тз);

		 	Результат.Вставить("ТабличнаяЧасть_"+ ТаблЧастьИмя, тз);

	КонецЦикла;
	//</Табл. части>
		
	//Коммуникатор.РазорватьПодключениеБД(БазаИсточник);
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ВставьВТаблицуЗначенийПервойСтрокойЗаголовкиКолонок(ТЗ)
	//добавить строчку с заголовком, если есть хотябы одна строка с данными
	
	//Если ТЗ.Количество()= 0 Тогда
	//	Возврат ТЗ
	//КонецЕсли;
	
	НовСтрока = ТЗ.Вставить(0);
	Для Каждого Кол Из ТЗ.Колонки Цикл
		Если ЗначениеЗаполнено(Кол.Заголовок) Тогда
			ВставитьЗначение = Кол.Заголовок;
		Иначе 
			ВставитьЗначение = Кол.Имя
		КонецЕсли;
		НовСтрока[Кол.Имя] = ВставитьЗначение;
	КонецЦикла;	
	Возврат ТЗ;
КонецФункции

&НаСервере
Функция КонвертируйТаблицуЗначений_в_HTMLТаблицу(ТЗ, ИмяКласса = "", ИмяКолонкиСТипомИСсылкой="");
	ЗначениеПоУмолчанию = "";
	
	Доступно = ТипЗнч(тз) = Тип("ТаблицаЗначений");
	
	Если Не Доступно Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Ряды="";

	Для Каждого СтрокаТЗ из ТЗ Цикл
		//ТекРяд ="<tr><td>"+ИмяРеквизита+"</td><td>"+ПредставлениеРекв+"</td><td>"+ЗначениеРекв+"</td></tr>"; 
		
		ТекРяд = "";
		Для Каждого Кол из ТЗ.Колонки Цикл
			// Если значение в колонке ТЗ не имеет тип значения строка, значит она не выводится в html-таблицу,
			// но предназначена для иных целей, например для формирования гиперссылки
			Если ТипЗнч(СтрокаТЗ[Кол.Имя])<>Тип("Строка") Тогда 
			 	Продолжить;
			КонецЕсли;
			Если ИмяКолонкиСТипомИСсылкой = "" Тогда // не формируем гиперссылку
				ТекРяд = ТекРяд+"<td>"+СтрокаТЗ[Кол.Имя]+"</td>";
			Иначе
				Если СтрНайти(Кол.Заголовок, "<Свойства><МожетСодержатьГиперСсылку>Истина</МожетСодержатьГиперСсылку></Свойства>") = 0 Тогда // не формируем гиперссылку
					ТекРяд = ТекРяд+"<td>"+СтрокаТЗ[Кол.Имя]+"</td>";
				Иначе
					Если СтрокаТЗ["ТипИСсылка"] = Неопределено Тогда // не формируем гиперссылку
						ТекРяд = ТекРяд+"<td>"+СтрокаТЗ[Кол.Имя]+"</td>";	
					Иначе
						ТипЗн = СтрокаТЗ["ТипИСсылка"].Тип;
						СсылкаЗн = СтрокаТЗ["ТипИСсылка"].Ссылка;
						Если СсылкаЗн="" Тогда  // не формируем гиперссылку
							ТекРяд = ТекРяд+"<td>"+СтрокаТЗ[Кол.Имя]+"</td>";
						Иначе
							Гиперссылка = "#"+СтрокаТЗ["ТипИСсылка"].Тип+"#"+ СтрокаТЗ["ТипИСсылка"].Ссылка;
							ТекРяд = ТекРяд+"<td><a href = "+Гиперссылка+">"+СтрокаТЗ[Кол.Имя]+"</a></td>";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ТекРяд  ="<tr class = ""tableRowDocHead"">"+ТекРяд+"</tr>";
		Ряды = Ряды + ТекРяд;
	КонецЦикла;
	
	Табл = "<div><table"+?("table_"+СтрДлина(ИмяКласса)=0,""," class = """+ИмяКласса+"""") +"><tbody>"+Ряды+"</tbody></table></div>";
	
	Возврат Табл;
	
КонецФункции

&НаСервере
Функция КонвертируйТаблицуЗначенийТабличнойЧасти_в_HTMLТаблицу(ТЗ, ИмяКласса = "");
	ЗначениеПоУмолчанию = "";
	
	Доступно = ТипЗнч(тз) = Тип("ТаблицаЗначений");
	
	Если Не Доступно Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Ряды="";

	Для Каждого СтрокаТЗ из ТЗ Цикл
		//ТекРяд ="<tr><td>"+ИмяРеквизита+"</td><td>"+ПредставлениеРекв+"</td><td>"+ЗначениеРекв+"</td></tr>"; 
		
		ТекРяд = "";
		Для Каждого Кол из ТЗ.Колонки Цикл
			
			// Если значение в колонке ТЗ не имеет тип значения строка, значит она не выводится в html-таблицу,
			// но предназначена для иных целей, например для формирования гиперссылки
			Если ТипЗнч(СтрокаТЗ[Кол.Имя])<>Тип("Строка") Тогда 
			 	Продолжить;
			КонецЕсли;
			
			//Если ИмяКолонкиСТипомИСсылкой = "" Тогда // не формируем гиперссылку
			//	ТекРяд = ТекРяд+"<td>"+СтрокаТЗ[Кол.Имя]+"</td>";
			//Иначе
				//Если СтрНайти(Кол.Заголовок, "<Свойства><МожетСодержатьГиперСсылку>Истина</МожетСодержатьГиперСсылку></Свойства>") = 0 Тогда // не формируем гиперссылку
				//	ТекРяд = ТекРяд+"<td>"+СтрокаТЗ[Кол.Имя]+"</td>";
				//Иначе
					//Если СтрокаТЗ["ТипИСсылка"] = Неопределено Тогда // не формируем гиперссылку
					//	ТекРяд = ТекРяд+"<td>"+СтрокаТЗ[Кол.Имя]+"</td>";	
					//Иначе
					    Попытка
							ТипЗн = СтрокаТЗ[Кол.Имя+"_ТипИСсылка"].Тип;
							СсылкаЗн = СтрокаТЗ[Кол.Имя+"_ТипИСсылка"].Ссылка;
						Исключение
							ТипЗн = "";
							СсылкаЗн = "";
					    КонецПопытки;
						Если СсылкаЗн="" Тогда  // не формируем гиперссылку
							ТекРяд = ТекРяд+"<td>"+СтрокаТЗ[Кол.Имя]+"</td>";
						Иначе
							Гиперссылка = "#"+СтрокаТЗ[Кол.Имя+"_ТипИСсылка"].Тип+"#"+ СтрокаТЗ[Кол.Имя+"_ТипИСсылка"].Ссылка;
							ТекРяд = ТекРяд+"<td><a href = "+Гиперссылка+">"+СтрокаТЗ[Кол.Имя]+"</a></td>";
						КонецЕсли;
					//КонецЕсли;
				//КонецЕсли;
			//КонецЕсли;
		КонецЦикла;
		
		ТекРяд  ="<tr class = ""tableRowDocHead"">"+ТекРяд+"</tr>";
		Ряды = Ряды + ТекРяд;
	КонецЦикла;
	
	Табл = "<div><table"+?("table_"+СтрДлина(ИмяКласса)=0,""," class = """+ИмяКласса+"""") +"><tbody>"+Ряды+"</tbody></table></div>";
	
	Возврат Табл;
	
КонецФункции

&НаСервере
Функция НTML__ПолучитьМакет(ИмяМакета) Экспорт
	Возврат ЭтотОбъект.ПолучитьМакет(ИмяМакета);
КонецФункции

&НаКлиенте
Процедура ТекстHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если  ДанныеСобытия.Anchor = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Гиперссылка = ДанныеСобытия.Anchor.nameProp;
	Если СтрДлина(Гиперссылка) = 0 Тогда
		Возврат
	КонецЕсли;
	
	ПозицияРазделителя1 = СтрНайти(Гиперссылка,"#",,,1);
	Если ПозицияРазделителя1 = 0 Тогда
		Возврат
	КонецЕсли;
	
	НекийНенужныйНамПрефикс = Лев(Гиперссылка,ПозицияРазделителя1-1);
	
	ПозицияРазделителя2 = СтрНайти(Гиперссылка,"#",,,2);
	ГУИДДокументаИсточникаСтрокой = Прав(Гиперссылка, СтрДлина(Гиперссылка)-ПозицияРазделителя2);
	
	ТипЗн = Сред(Гиперссылка, ПозицияРазделителя1+1,СтрДлина(Гиперссылка)-(СтрДлина(НекийНенужныйНамПрефикс)+1) - (СтрДлина(ГУИДДокументаИсточникаСтрокой)+1));
	Если СтрНайти(ТипЗн, "CatalogRef") Тогда
		ИдОбъекта = "Справочник"
	ИначеЕсли  СтрНайти(ТипЗн, "DocumentRef") Тогда
		ИдОбъекта = "Документ"
	КонецЕсли;
	
	ПозицияРазделителя	= СтрНайти(ТипЗн, ".");
	ИдВидаДокумента		= Прав(ТипЗн, СтрДлина(ТипЗн)-ПозицияРазделителя);
	
	Парам = Новый Структура();
	Парам.Вставить("ПараметрыСоединения"		, ЭтаФорма.Параметры.ПараметрыСоединения);
	Парам.Вставить("ИдОбъектаМетаданных"		, ИдОбъекта); //"Справочник", "Документ"
	Парам.Вставить("ИдВидаОбъекта"				, ИдВидаДокумента);
	Парам.Вставить("ГУИДОбъектаСтрокой"			, ГУИДДокументаИсточникаСтрокой);	
	Фрм = ОткрытьФорму("ВнешняяОбработка.ОбменДанными.Форма.ФормаОбъектаНTML", Парам,,Новый УникальныйИдентификатор());

КонецПроцедуры





