Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = Новый Структура();
	РегистрационныеДанные.Вставить("Наименование", "Загрузка СТО");
	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
	РегистрационныеДанные.Вставить("Версия", "2021-07-21");
	РегистрационныеДанные.Вставить("Информация", "Обработка предназначена для загрузки документов СТО. НЕОБХОДИМО ОБНОВИТЬ КОНФИГУРАЦИЮ (добавлен счет учета запчастей для организации");
	РегистрационныеДанные.Вставить("Вид", "ДополнительнаяОбработка");
	
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("Идентификатор");
	тз.Колонки.Добавить("Использование");
	тз.Колонки.Добавить("Представление");
	
	НоваяСтрока = тз.Добавить();
	НоваяСтрока.Идентификатор = "ОткрытьОбработку";
	НоваяСтрока.Использование = "ОткрытиеФормы";
	НоваяСтрока.Представление = "Загрузка СТО";
	
	РегистрационныеДанные.Вставить("Команды", тз);
	
	Возврат РегистрационныеДанные;
	
КонецФункции


//27-08-2020  Убрала проверку на имя договора "Оферта"

// 28-08-2020  Добавила проверку на КПП с кодом 43

//01-09-2020  Исправлена проверка по виду оплаты для раздела Страхование

//21-09-2020 Добавлено настройка соответствия наименования номенклатуры и ЕИ

//14-10-2020 Добавила в настройки вид расчетов договоров (по запросу Уфы) и вид номенклатуры Автомобилей

//05-11-2020 Добавила в комментарий реализации (заказ-наряд) ФИО физ.лица для частных лиц

//11-11-2020 Изменения в форме (добавлены колонки "Вариант загрузки" и "есть ошибки", добавлено условное оформление

//20-11-2020 Если контрагент - частное лицо, договор по дате и номеру не искать

//11-01-2021 Заменила способ заполнения контактной информации нового юр.лица

//21-01-2021 Добавлены загрузки реализации и поступления материалов

//10-02-2021 Добавлены статусы проверки контрагентов, исправлен поиск договора по УИД (добавлен отбор по владельцу)

//23-03-2021 Тестовая версия: добавлены документы "Услуги производства" и "Реализация услуг"  - необходима загрузка измененной конфигурации

//13-05-2021 Добавлена возможность записи непроведенных документов (для записи в закрытый период) с возможностью изменить дату документа после записи

//12-07-2021 Исправлено заполнение принятия к учету затрат УСН в документах межхолдера

//21-07-2021 Добавлена возможность выбора счета учета номенклатуры в настройках организации и заполнение табличных частей документов СТО этими счетами (НЕОБХОДИМО ОБНОВИТЬ КОНФИГУРАЦИЮ)